## Plan Result (prod_shutter_webapp)




<pre><code>Plan: 5 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;sptribs-dss-update-case-web&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;sptribs-dss-update-case-web&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;sptribs-dss-update-case-web&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;sptribs-dss-update-case-web&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;sptribs-dss-update-case-web&#34;]
* Update
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;div-pfe&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "update-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "special-tribunals.service.gov.uk"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["div-pfe"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "5bz95ky3c27gb6475yz0yx2x1g4wg6qc" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.update"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "special-tribunals.service.gov.uk"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "sptribs-dss-update-case-web"
      + resource_group_name = "cft-platform-shutter-webapp-prod-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "update.special-tribunals.service.gov.uk"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["sptribs-dss-update-case-web"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "sptribs_dss_update_case_web_prod"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        # (33 unchanged elements hidden)
        {
            backend_domain    = [
                "firewall-prod-int-palo-cftprod.uksouth.cloudapp.azure.com",
            ]
            certificate_name  = "special-tribunals-service-gov-uk"
            custom_domain     = "special-tribunals.service.gov.uk"
            dns_zone_name     = "special-tribunals.service.gov.uk"
            global_exclusions = [
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "connect.sid"
                },
                {
                    match_variable = "QueryStringArgNames"
                    operator       = "Equals"
                    selector       = "iss"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "session"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "StartsWith"
                    selector       = "__auth-token"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_ga"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_gid"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_gat"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "dtCookie"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "dtLatC"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "dtPC"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "dtSa"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "rxVisitor"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "rxvt"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "cookies_policy"
                },
                {
                    match_variable = "QueryStringArgNames"
                    operator       = "Equals"
                    selector       = "rf"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "sptribs-cookie-preferences"
                },
                {
                    match_variable = "QueryStringArgNames"
                    operator       = "Equals"
                    selector       = "_csrf"
                },
                {
                    match_variable = "RequestBodyPostArgNames"
                    operator       = "Equals"
                    selector       = "_csrf"
                },
            ]
            mode              = "Prevention"
            name              = "sptribs-frontend"
            product           = "sptribs"
            ssl_mode          = "AzureKeyVault"
            www_redirect      = true
        },
      + {
          + backend_domain    = [
              + "firewall-prod-int-palo-cftprod.uksouth.cloudapp.azure.com",
            ]
          + certificate_name  = "special-tribunals-service-gov-uk"
          + custom_domain     = "update.special-tribunals.service.gov.uk"
          + dns_zone_name     = "special-tribunals.service.gov.uk"
          + global_exclusions = [
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "connect.sid"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "iss"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "sptribs-dss-update-case-web-session"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "StartsWith"
                  + selector       = "__auth-token"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "_ga"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "_gid"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "_gat"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtCookie"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtLatC"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtPC"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "dtSa"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "rxVisitor"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "rxvt"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "cookies_policy"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "rf"
                },
              + {
                  + match_variable = "RequestCookieNames"
                  + operator       = "Equals"
                  + selector       = "sptribs-dss-update-case-web-cookie-preferences"
                },
              + {
                  + match_variable = "QueryStringArgNames"
                  + operator       = "Equals"
                  + selector       = "_csrf"
                },
              + {
                  + match_variable = "RequestBodyPostArgNames"
                  + operator       = "Equals"
                  + selector       = "_csrf"
                },
            ]
          + mode              = "Prevention"
          + name              = "sptribs-dss-update-case-web"
          + product           = "sptribs"
          + ssl_mode          = "AzureKeyVault"
          + www_redirect      = true
        },
        {
            backend_domain    = [
                "firewall-prod-int-palo-cftprod.uksouth.cloudapp.azure.com",
            ]
            certificate_name  = "employmenttribunals-service-gov-uk"
            custom_domain     = "employmenttribunals.service.gov.uk"
            custom_rules      = [
                {
                    action           = "Block"
                    match_conditions = [
                        {
                            match_values       = [
                                "^https://[a-zA-Z0-9.-]*.gov.uk/apply/admin[/]?.*",
                            ]
                            match_variable     = "RequestUri"
                            negation_condition = false
                            operator           = "RegEx"
                        },
                        {
                            match_values       = [
                                "81.134.202.29/32",
                                "51.145.6.230/32",
                                "194.33.192.0/25",
                                "194.33.196.0/25",
                                "51.145.4.100/32",
                                "157.203.176.139/32",
                                "157.203.176.138/32",
                                "157.203.176.140/32",
                                "157.203.176.190/32",
                                "157.203.176.191/32",
                                "157.203.176.192/32",
                                "51.149.249.32/27",
                                "51.149.249.0/27",
                                "20.108.187.55/32",
                                "20.58.23.145/32",
                            ]
                            match_variable     = "RemoteAddr"
                            negation_condition = true
                            operator           = "IPMatch"
                        },
                    ]
                    name             = "IPMatchWhitelist"
                    priority         = 1
                    type             = "MatchRule"
                },
            ]
            dns_zone_name     = "employmenttribunals.service.gov.uk"
            global_exclusions = [
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "cookie_setting"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_app_session"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_utma"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_utmb"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_utmc"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_utmz"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "_ga"
                },
                {
                    match_variable = "RequestCookieNames"
                    operator       = "Equals"
                    selector       = "et-sya-cookie-preferences"
                },
            ]
            mode              = "Prevention"
            name              = "et-pet"
            product           = "et-pet"
            shutter_app       = true
            ssl_mode          = "AzureKeyVault"
            www_redirect      = true
        },
        # (7 unchanged elements hidden)
    ]
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2104,"Program":"tfcmt","SHA1":"","Target":"prod_shutter_webapp","Vars":{}} -->